[
  {
    "message_id": 164,
    "text": "<b>New Update</b> <b><u>(READ CAREFULLY! - USE THE RELEASE VERSION OF THE APK)</u></b><br>• Added support for the latest Grindr version (25.12.1 140963).<br><br><b>IMPORTANT NOTES:</b><br>• Both Quick Block and AntiBlock HAVE BEEN DISABLED BECAUSE THEY DON'T WORK AND NEED A REFACTOR.<br><br><b>HOW TO UPDATE</b><br><u>You can update without uninstalling the original Grindr app</u> if you're upgrading from the previous 4.3.X version of the mod.",
    "date": 1753273519
  },
  {
    "message_id": 165,
    "text": "The main differences between <b>debug</b> and <b>release</b> APKs are the amount of logging and the fact that the debug version <b>disables SSL pinning</b>. Additionally, the <b>signatures differ</b>, so switching between debug and release versions isn't straightforward. Be cautious when doing so. Regular users typically don't need the debug version and should stick to the release version instead.",
    "date": 1753273685
  },
  {
    "message_id": 166,
    "text": "<b><u>About UK Age Verification Requirements</u></b><br>As of July 25th, 2025, the UK government will make age verification legally mandatory for all apps and services that allow adult content, including Grindr. This is enforced by Ofcom under the Online Safety Act.<br><br>⚠️ <b><u>IMPORTANT NOTICE:</u></b><br><b>GrindrPlus will NOT help you get around this verification by any means</b>. Previously, you could force the feature flag to be disabled because it wasn't mandatory by law yet, Grindr was just testing things out.<br><br>Now that it's legally required, any code that interferes with age verification has been completely removed because this project will not help anyone break the law or create legal issues.<br><br><b><u>A NEW RULE WILL BE ADDED</u></b> to this group strictly prohibiting any discussions, questions, or requests related to bypassing age verification requirements. Violations will result in <b><u>IMMEDIATE REMOVAL FROM THE GROUP</u></b>.<br><br><b>NOTE:</b> Even if someone managed to bypass the client-side verification, Grindr's servers will not allow you to continue without proper age verification completion so don't waste your time.<br><br>❓<b><u>WHAT YOU NEED TO DO:</u></b><br>If you encounter the age verification screen, GrindrPlus will show a dialog preventing you from continuing and explaining the legal requirements <b>(this will happen from now on in new versions).</b><br><br><b>If you use LSPosed, just disable the module temporarily, complete the verification process in the official app, then enable it back.</b><br><br>If <b><u>YOU ARE NOT USING LSPOSED</u></b>, you must <b><u>UNINSTALL GRINDRPLUS</u></b> completely and <b><u>USE THE OFFICIAL GRINDR APP TO COMPLETE THE VERIFICATION PROCESS</u></b> first. Only after successful verification through the official app can you <b><u>REINSTALL GRINDRPLUS.</u></b><br><br><b>More info:</b> <a href=\"https://www.ofcom.org.uk/online-safety/protecting-children/age-checks-for-online-safety--what-you-need-to-know-as-a-user\">https://www.ofcom.org.uk/online-safety/protecting-children/age-checks-for-online-safety--what-you-need-to-know-as-a-user</a>",
    "date": 1753341392
  },
  {
    "message_id": 169,
    "text": "<b>New Update<br></b>• Added BMI toggle.<br>• Should fix inbox / chat filters.<br>• Re-enabled user blocking.<br>• Restored QuickBlock functionality. It should now be stable. If it fails, it will automatically disable itself, and you can still block users through the standard Grindr pop-up interface.<br>• Reinstated the AntiBlock hook. This feature is now more reliable and should log blocks even when the app is running in the background (<b>note: not when fully closed</b>).<br>• Fixed teleport command issues. Commands using location names instead of coordinates should now work consistently.<br><br><b>HOW TO UPDATE</b><br><u>You can update without uninstalling the original Grindr app</u> if you're upgrading from the previous 4.4.X version of the mod.<br><br><b>Non-root method (for users who normally use the GrindrPlus manager to install the mod):</b><br>• Install the new version of GrindrPlus over the existing installation<br>• Open the new version of GrindrPlus and navigate to the Install section<br>• Select the latest 4.4.0 version from the available options<br>• Click the Install button and wait for the APK to download and patch<br>• When prompted to upgrade Grindr, select \"Yes\"<br>• Done<br><br><b>Root method (for LSPosed users):</b><br>• Install the new version of GrindrPlus over the existing installation<br>• Done<br><br>⚠️ <b>FOR LSPOSED USERS ONLY: You need the </b><a href=\"https://www.apkmirror.com/apk/grindr-llc/grindr-gay-chat-meet-date/grindr-gay-dating-chat-25-12-1-release/grindr-gay-dating-chat-25-12-1-android-apk-download/\"><b><u>140963</u></b></a> <b>version of Grindr</b><br><a href=\"https://www.apkmirror.com/apk/grindr-llc/grindr-gay-chat-meet-date/grindr-gay-dating-chat-25-12-1-release/grindr-gay-dating-chat-25-12-1-android-apk-download/\"><b>Download from APKMirror</b></a><br><i>(I believe it's also the latest version available on Play Store)</i>",
    "date": 1753542933
  },
  {
    "message_id": 170,
    "text": "Forgot to say it includes a toggle to control whether BMI shows up or not and it also should fix chat / inbox filters.",
    "date": 1753545109
  },
  {
    "message_id": 171,
    "text": "<b>For those experiencing connection issues or profiles not loading with the mod:</b><br><br>Please try the following:<br>1. Go to <b>GrindrPlus → Settings</b> and <b><u>disable</u></b> the <code>Disable Updates</code> hook.<br>2. <b><u>Force close</u></b> both Grindr and GrindrPlus.<br>3. Reopen the apps and check if the issue persists.<br><br>Let us know if this resolves the problem by reporting your results. Your feedback is appreciated.",
    "date": 1753877256
  },
  {
    "message_id": 172,
    "text": "a",
    "date": 1758189235
  },
  {
    "message_id": 173,
    "text": "New Update\n• Fixed ColorOS bug. (LSPatch update)\n• Added News tab: Messages sent in this channel will be displayed in the manager.",
    "date": 1758192181
  },
  {
    "message_id": 174,
    "text": "New Update\n• Fixed ColorOS bug. (LSPatch update)\n• Added News tab: Messages sent in this channel will be displayed in the manager.",
    "date": 1758192191
  },
  {
    "message_id": 177,
    "text": "Grindr has recently discontinued version v25.12.1, which means the current mod is no longer functional.\n\nWe’re aware of this and are already working on an update.\n\nPlease be patient, a new version compatible with the latest Grindr release will be available soon.",
    "date": 1758213808
  },
  {
    "message_id": 180,
    "text": "New Update\n• Added support for the latest Grindr version (25.15.0 144041).\n• Includes updated LSPatch, which should fix issues on OnePlus / OPPO / Realme devices.\n• Introduced new \"News\" section, with alerts from this channel.",
    "date": 1758232562
  },
  {
    "message_id": 181,
    "text": "Grindr appears to be down, as many users have reported issues. Please don’t complain that “Grindr Plus isn’t working,” as this is something we can’t fix.\n\nYou can check the status here: https://downforeveryoneorjustme.com/grindr",
    "date": 1759937163
  },
  {
    "message_id": 182,
    "text": "CLOUDFLARE IS EXPERIENCING INTERMITTENT ISSUES. THIS IS AFFECTING GRINDR. THIS IS NOT A GRINDR OR GRINDR PLUS ISSUE. THERE IS NOTHING YOU CAN DO TO FIX THIS. WAIT FOR SERVICE RESTORATION.\n\nhttps://www.cloudflarestatus.com/",
    "date": 1763467193
  },
  {
    "message_id": 183,
    "text": "https://t.me/GrindrPlus/38490\n\nAll OxygenOS, ColorOS OnePlus, Oppo, RealMe users (unrooted) having issues with recent Android security updates.",
    "date": 1763917742
  },
  {
    "message_id": 184,
    "text": "GrindrPlus needs an update. The main developer is currently taking a break from the project, and it’s unclear when development will resume.",
    "date": 1764870374
  },
  {
    "message_id": 185,
    "text": "Merry Christmas from the GrindrPlus team! 🎄🎁",
    "date": 1766619714
  },
  {
    "message_id": 190,
    "text": "Happy NYE from the G+ Team! #push",
    "date": 1767362506
  }
]
